app/commands/authorize_api_request.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def user
    @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token