app/controllers/items_controller.rb

INSERT INTO "items" ("title", "is_completed", "todo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "items".* FROM "items" WHERE "items"."todo_id" = $1 ORDER BY "items"."id" DESC LIMIT $2  [["todo_id", 3], ["LIMIT", 1]]
---
  def create
    if @todo
      @todo&.items.create!(item_params)
      render json: { status: 200, message: 'Item created successfully', data: @todo.items.last }

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."created_by" = $2 LIMIT $3  [["id", 1], ["created_by", "1"], ["LIMIT", 1]]
UPDATE "items" SET "title" = $1, "is_completed" = $2, "updated_at" = $3 WHERE "items"."id" = $4
---
  def update
    todo = Todo.find_by(id: params[:todo_id], created_by: current_user.id)

    if todo && @item
      if @item&.update(item_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."created_by_id" = $2 LIMIT $3  [["id", 1], ["created_by_id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 2]]
---
  def destroy
    todo = Todo.find_by(id: params[:todo_id], created_by: current_user.id)
    if todo && @item
      @item.destroy

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_todo
    @todo = Todo.find_by(id: params[:todo_id])

SELECT  "items".* FROM "items" WHERE "items"."todo_id" = $1 AND "items"."id" = $2 LIMIT $3  [["todo_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def set_todo_item
    @item = @todo.items.find_by(id: params[:id]) if @todo