app/controllers/todos_controller.rb

  def index
    todos = current_user.todos.paginate(page: params[:page], per_page: per_page)
    todo_list = if params[:is_completed].present?
                  ::Todo.load_todo_list(todos, completed?)
                else
                  todos.collect do |td|
---
SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" WHERE (items.is_completed = 'true')

  def show
    todo = Todo.find_by(id: params[:id], created_by: current_user.id)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."created_by" = $2 LIMIT $3  [["id", 1], ["created_by", "1"], ["LIMIT", 1]]

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "description", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    todo = Todo.find_by(id: params[:id], created_by: current_user.id)

    if todo
      if todo&.update(todo_update_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."created_by" = $2 LIMIT $3  [["id", 1], ["created_by", "1"], ["LIMIT", 1]]
UPDATE "todos" SET "created_by" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["created_by", "2"], ["updated_at", "2020-02-08 17:10:09.437110"], ["id", 1]]

  def destroy
    todo = Todo.find_by(id: params[:id], created_by: current_user.id)
    if todo
      todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 AND "todos"."created_by" = $2 LIMIT $3  [["id", 2], ["created_by", "1"], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]