app/models/todo.rb

  def self.load_todo_list(todos, is_done)
    todos = todos.collect do |td|
      if is_done == true
        if !completed_todo_items(td.items).empty?
          {
            id: td.id,
            title: td.title,
            description: td&.description,
            created_by: td.created_by,
            items: completed_todo_items(td.items)
          }
        else
          next
        end
      else
        if !not_completed_todo_items(td.items).empty?
---
SELECT "todos".* FROM "todos"
SELECT "items".* FROM "items" WHERE "items"."todo_id" = $1  [["todo_id", 2]]